-------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\大三上\中级计量经济学\老师发的\Lab\上机3&4\2.log
  log type:  text
 opened on:  13 Nov 2018, 20:48:20

. clear all

. cd "D:\大三上\中级计量经济学\老师发的\Lab\上机3&4"  /*for windows*/
D:\大三上\中级计量经济学\老师发的\Lab\上机3&4

. *cd "/Volumes/HAS/大三上/中级计量经济学/老师发的/Lab/上机3&4"
. 
. *HW2_2_Seatbelts
. clear all

. use SeatBelts

. encode state, gen(state1)

. *destring state, replace
. *a
. gen lnin = ln(income)

. reg fatalityrate sb_useage speed65 speed70 ba08 drinkage21 lnin age, r

Linear regression                               Number of obs     =        556
                                                F(7, 548)         =      90.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5493
                                                Root MSE          =      .0034

------------------------------------------------------------------------------
             |               Robust
fatalityrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   sb_useage |   .0040684   .0012323     3.30   0.001     .0016478    .0064889
     speed65 |   .0001479   .0004076     0.36   0.717    -.0006527    .0009486
     speed70 |   .0024045   .0004721     5.09   0.000     .0014771    .0033319
        ba08 |  -.0019246   .0003612    -5.33   0.000     -.002634   -.0012151
  drinkage21 |   .0000799   .0009872     0.08   0.936    -.0018593     .002019
        lnin |  -.0181444    .001086   -16.71   0.000    -.0202776   -.0160111
         age |  -7.22e-06   .0001644    -0.04   0.965    -.0003302    .0003158
       _cons |   .1965469   .0092503    21.25   0.000     .1783766    .2147172
------------------------------------------------------------------------------

. /* the coefficient is 0.0040684, pretty samll, but the t=3.30 >0 . This regression 
> does not suggest
> seat belt use reduces fatalities. */
. *b
. xtset state1 year
       panel variable:  state1 (strongly balanced)
        time variable:  year, 1983 to 1997
                delta:  1 unit

. xtreg fatalityrate sb_useage speed65 speed70 ba08 drinkage21 lnin age, fe vce(clust
> er state1)

Fixed-effects (within) regression               Number of obs     =        556
Group variable: state1                          Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.6868                                         min =          8
     between = 0.1957                                         avg =       10.9
     overall = 0.3896                                         max =         15

                                                F(7,50)           =      96.72
corr(u_i, Xb)  = -0.1332                        Prob > F          =     0.0000

                                (Std. Err. adjusted for 51 clusters in state1)
------------------------------------------------------------------------------
             |               Robust
fatalityrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   sb_useage |  -.0057748   .0016693    -3.46   0.001    -.0091276    -.002422
     speed65 |   -.000425   .0004555    -0.93   0.355    -.0013399    .0004898
     speed70 |   .0012333   .0003483     3.54   0.001     .0005337    .0019329
        ba08 |  -.0013775   .0003751    -3.67   0.001    -.0021308   -.0006241
  drinkage21 |   .0007453   .0007184     1.04   0.305    -.0006976    .0021883
        lnin |  -.0135144   .0023849    -5.67   0.000    -.0183047   -.0087241
         age |   .0009787   .0007461     1.31   0.196    -.0005199    .0024772
       _cons |   .1209958   .0184235     6.57   0.000     .0839912    .1580005
-------------+----------------------------------------------------------------
     sigma_u |  .00383103
     sigma_e |   .0017871
         rho |  .82128567   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. /* Yes, because every state has its own culture,roads,weather and state's law, ther
> e are 
> some things that won't change across time in a state */
. *c
. xtset state1 year
       panel variable:  state1 (strongly balanced)
        time variable:  year, 1983 to 1997
                delta:  1 unit

. xtreg fatalityrate i.year sb_useage speed65 speed70 ba08 drinkage21 lnin age, fe vc
> e(cluster state1)

Fixed-effects (within) regression               Number of obs     =        556
Group variable: state1                          Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.7506                                         min =          8
     between = 0.1139                                         avg =       10.9
     overall = 0.0338                                         max =         15

                                                F(21,50)          =      52.30
corr(u_i, Xb)  = -0.5086                        Prob > F          =     0.0000

                                (Std. Err. adjusted for 51 clusters in state1)
------------------------------------------------------------------------------
             |               Robust
fatalityrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        year |
       1984  |  -.0004319    .001378    -0.31   0.755    -.0031998     .002336
       1985  |  -.0010707   .0017641    -0.61   0.547     -.004614    .0024726
       1986  |  -.0005777   .0020078    -0.29   0.775    -.0046106    .0034551
       1987  |  -.0008722   .0024939    -0.35   0.728    -.0058813    .0041368
       1988  |   -.001885    .002877    -0.66   0.515    -.0076636    .0038936
       1989  |  -.0041766   .0032564    -1.28   0.206    -.0107172    .0023641
       1990  |   -.005266   .0035402    -1.49   0.143    -.0123767    .0018448
       1991  |  -.0066622   .0037593    -1.77   0.082    -.0142131    .0008886
       1992  |   -.008518   .0039855    -2.14   0.037    -.0165232   -.0005128
       1993  |  -.0089399    .004199    -2.13   0.038    -.0173738    -.000506
       1994  |  -.0096297   .0045934    -2.10   0.041    -.0188559   -.0004035
       1995  |  -.0101123   .0048961    -2.07   0.044    -.0199464   -.0002782
       1996  |  -.0110766   .0052089    -2.13   0.038    -.0215389   -.0006142
       1997  |  -.0116075   .0055341    -2.10   0.041    -.0227231   -.0004919
             |
   sb_useage |  -.0037186   .0014515    -2.56   0.013    -.0066339   -.0008032
     speed65 |  -.0007833   .0005801    -1.35   0.183    -.0019484    .0003818
     speed70 |   .0008042   .0004572     1.76   0.085    -.0001142    .0017225
        ba08 |  -.0008225   .0004433    -1.86   0.069    -.0017128    .0000678
  drinkage21 |  -.0011337   .0006221    -1.82   0.074    -.0023831    .0001158
        lnin |   .0062643   .0066992     0.94   0.354    -.0071913      .01972
         age |    .001318   .0006937     1.90   0.063    -.0000753    .0027114
       _cons |  -.0779904   .0663611    -1.18   0.245    -.2112805    .0552998
-------------+----------------------------------------------------------------
     sigma_u |  .00575371
     sigma_e |  .00161752
         rho |  .92675648   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. /* Yes, the results have changed. */
. *d
. /* the regression of (c) is most reliable, F=52.30,it's significant at 1%, 
> we can use time fixed and state fixed effect to regress, it's better*/
. *e
. sum vmt

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         vmt |        765    41447.73    43961.99       3099     285612

. /* It's not large. 
> the avearge of vmt is 41447.73 
> (0.90-0.52)*0.37186 =0.14
> 0.14*41447.73 =58 people */
. *f
. xtset state1 year
       panel variable:  state1 (strongly balanced)
        time variable:  year, 1983 to 1997
                delta:  1 unit

. xtreg sb_useage i.year primary secondary speed65 speed70 ba08 drinkage21 lnin age, 
> fe vce(cluster state1)

Fixed-effects (within) regression               Number of obs     =        556
Group variable: state1                          Number of groups  =         51

R-sq:                                           Obs per group:
     within  = 0.8420                                         min =          8
     between = 0.4612                                         avg =       10.9
     overall = 0.7035                                         max =         15

                                                F(22,50)          =     503.39
corr(u_i, Xb)  = 0.0527                         Prob > F          =     0.0000

                                (Std. Err. adjusted for 51 clusters in state1)
------------------------------------------------------------------------------
             |               Robust
   sb_useage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        year |
       1984  |   .0041178   .0285473     0.14   0.886    -.0532211    .0614567
       1985  |   .0575169   .0430389     1.34   0.187    -.0289292     .143963
       1986  |   .1073527   .0551177     1.95   0.057    -.0033546    .2180599
       1987  |   .1240647   .0771166     1.61   0.114    -.0308286     .278958
       1988  |   .1390924   .0976105     1.42   0.160    -.0569641    .3351488
       1989  |   .1702325   .1129775     1.51   0.138    -.0566894    .3971544
       1990  |   .1897753   .1292799     1.47   0.148     -.069891    .4494416
       1991  |   .2370697   .1370662     1.73   0.090    -.0382358    .5123752
       1992  |   .2633971   .1522132     1.73   0.090    -.0423321    .5691263
       1993  |   .2824192   .1635142     1.73   0.090    -.0460087     .610847
       1994  |   .2983722    .173835     1.72   0.092    -.0507857    .6475301
       1995  |   .2959081   .1852817     1.60   0.117    -.0762411    .6680573
       1996  |   .2875641   .1986254     1.45   0.154    -.1113869     .686515
       1997  |   .2977352    .210314     1.42   0.163    -.1246929    .7201632
             |
     primary |   .2055968   .0231787     8.87   0.000     .1590411    .2521526
   secondary |   .1085184   .0134089     8.09   0.000     .0815859    .1354509
     speed65 |   .0228485   .0205171     1.11   0.271    -.0183612    .0640583
     speed70 |   .0120424   .0205918     0.58   0.561    -.0293174    .0534022
        ba08 |   .0037584   .0176175     0.21   0.832    -.0316275    .0391443
  drinkage21 |   .0107149   .0271708     0.39   0.695    -.0438592     .065289
        lnin |   .0582708   .2564405     0.23   0.821    -.4568052    .5733468
         age |   .0138232   .0231337     0.60   0.553    -.0326422    .0602886
       _cons |   -.893022   2.642246    -0.34   0.737    -6.200129    4.414085
-------------+----------------------------------------------------------------
     sigma_u |  .07907703
     sigma_e |  .05722479
         rho |  .65630494   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. /* primary and secondary both lead to more seat belt use. */
. *g
. /*
> 0.2055968-0.1085184 =0.0970784
> 0.37186*0.0970784 =0.0360996
> 63308*0.0360996 =23
> NJ's population of 1997 is 63308
> */
. 
. log close
      name:  <unnamed>
       log:  D:\大三上\中级计量经济学\老师发的\Lab\上机3&4\2.log
  log type:  text
 closed on:  13 Nov 2018, 20:48:21
-------------------------------------------------------------------------------------
