-------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\大三上\中级计量经济学\老师发的\Lab\上机3&4\4.log
  log type:  text
 opened on:  13 Nov 2018, 20:48:31

. *HW2_4_Movies
. clear all

. cd "D:\大三上\中级计量经济学\老师发的\Lab\上机3&4" 
D:\大三上\中级计量经济学\老师发的\Lab\上机3&4

. use Movies

. global yeardum "year2 year3 year4 year5 year6 year7 year8 year9 year10"

. global monthdum "month2 month3 month4 month5 month6 month7 month8 month9 month10 mo
> nth11 month12"

. global holidum "h_chris h_newyr h_easter h_july4 h_mem h_labor"

. global weatherdum "w_rain w_snow w_maxa w_maxb w_maxc w_mina w_minb w_minc"

. 
. *a
. *(i
. gen ln_assaults = ln(assaults)

. reg ln_assaults $yeardum $monthdum, r

Linear regression                               Number of obs     =        516
                                                F(20, 495)        =    3081.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9917
                                                Root MSE          =     .05868

------------------------------------------------------------------------------
             |               Robust
 ln_assaults |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       year2 |   .6949052   .0138627    50.13   0.000     .6676681    .7221423
       year3 |   1.008377   .0136139    74.07   0.000     .9816289    1.035125
       year4 |   1.245359   .0133617    93.20   0.000     1.219106    1.271611
       year5 |   1.414503   .0166844    84.78   0.000     1.381722    1.447284
       year6 |   1.695259   .0135572   125.05   0.000     1.668622    1.721896
       year7 |   1.850901    .012663   146.17   0.000     1.826021     1.87578
       year8 |   1.901345   .0136947   138.84   0.000     1.874438    1.928252
       year9 |   1.943667   .0133783   145.28   0.000     1.917382    1.969953
      year10 |    2.07023   .0135387   152.91   0.000     2.043629     2.09683
      month2 |   .0168826   .0136026     1.24   0.215    -.0098434    .0436087
      month3 |   .0799446   .0129937     6.15   0.000      .054415    .1054742
      month4 |   .1297383   .0126781    10.23   0.000     .1048288    .1546478
      month5 |   .1802473    .011404    15.81   0.000     .1578411    .2026535
      month6 |    .166302   .0112944    14.72   0.000      .144111    .1884929
      month7 |   .1738895   .0113494    15.32   0.000     .1515905    .1961885
      month8 |   .1767969   .0114499    15.44   0.000     .1543004    .1992933
      month9 |   .1976758   .0126287    15.65   0.000     .1728633    .2224883
     month10 |   .1417214   .0129199    10.97   0.000     .1163367     .167106
     month11 |   .0248213   .0132296     1.88   0.061    -.0011718    .0508145
     month12 |  -.0054357   .0201344    -0.27   0.787     -.044995    .0341237
       _cons |   6.727564   .0158717   423.87   0.000     6.696379    6.758748
------------------------------------------------------------------------------

. *There tend to be more assaults in month5,6,7,8,9
. *(ii
. gen attend = attend_v + attend_m + attend_n

. reg attend  $yeardum $monthdum, r

Linear regression                               Number of obs     =        516
                                                F(20, 495)        =      42.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4801
                                                Root MSE          =     3.6081

------------------------------------------------------------------------------
             |               Robust
      attend |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       year2 |   .8971667   .7636281     1.17   0.241    -.6031852    2.397519
       year3 |   2.031086   .7631443     2.66   0.008     .5316844    3.530487
       year4 |   3.399118   .7252725     4.69   0.000     1.974126    4.824111
       year5 |   2.951545   .7224094     4.09   0.000     1.532178    4.370911
       year6 |   2.512028   .7010538     3.58   0.000      1.13462    3.889436
       year7 |   3.122399   .7485516     4.17   0.000     1.651668    4.593129
       year8 |   5.041182   .7495138     6.73   0.000     3.568561    6.513803
       year9 |   4.405701   .7076609     6.23   0.000     3.015312    5.796091
      year10 |   3.727569   .6969277     5.35   0.000     2.358268     5.09687
      month2 |  -.6612766   .7009894    -0.94   0.346    -2.038558     .716005
      month3 |  -2.168523   .5955573    -3.64   0.000    -3.338654   -.9983908
      month4 |  -3.403276   .5814554    -5.85   0.000    -4.545701   -2.260851
      month5 |   .9224337   .9270315     1.00   0.320    -.8989681    2.743836
      month6 |   2.916713   .7300392     4.00   0.000     1.482355     4.35107
      month7 |   5.393685   .6953635     7.76   0.000     4.027457    6.759913
      month8 |   1.212276   .7704702     1.57   0.116    -.3015197    2.726071
      month9 |  -5.425176    .616106    -8.81   0.000    -6.635682   -4.214671
     month10 |  -3.325857   .5581642    -5.96   0.000    -4.422521   -2.229194
     month11 |   3.879529    .843322     4.60   0.000     2.222597    5.536461
     month12 |   .6773855   1.085198     0.62   0.533    -1.454776    2.809547
       _cons |   16.03961   .7462924    21.49   0.000     14.57332     17.5059
------------------------------------------------------------------------------

. *month5,6,7,8 have more movie attendance. Seasonality exists.
. *b
. reg ln_assaults attend_v attend_m attend_n $yeardum $monthdum $holidum $weatherdum,
>  r

Linear regression                               Number of obs     =        516
                                                F(37, 478)        =    3166.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9959
                                                Root MSE          =     .04189

------------------------------------------------------------------------------
             |               Robust
 ln_assaults |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    attend_v |  -.0031689   .0010095    -3.14   0.002    -.0051525   -.0011854
    attend_m |  -.0031382   .0007002    -4.48   0.000    -.0045141   -.0017623
    attend_n |  -.0021052   .0007404    -2.84   0.005      -.00356   -.0006504
       year2 |   .7008109   .0098018    71.50   0.000     .6815509    .7200709
       year3 |   1.017069   .0100452   101.25   0.000     .9973307    1.036807
       year4 |    1.22673   .0098888   124.05   0.000     1.207299     1.24616
       year5 |   1.389127   .0113609   122.27   0.000     1.366803     1.41145
       year6 |   1.688294   .0091901   183.71   0.000     1.670236    1.706352
       year7 |   1.839547   .0097684   188.32   0.000     1.820352    1.858741
       year8 |   1.898393   .0104275   182.06   0.000     1.877904    1.918883
       year9 |   1.950122    .010452   186.58   0.000     1.929585     1.97066
      year10 |   2.072147   .0105116   197.13   0.000     2.051492    2.092801
      month2 |  -.0072582   .0124247    -0.58   0.559     -.031672    .0171556
      month3 |   .0125548   .0124661     1.01   0.314    -.0119403    .0370499
      month4 |   .0018641   .0153559     0.12   0.903    -.0283094    .0320375
      month5 |   .0079486   .0158838     0.50   0.617    -.0232621    .0391593
      month6 |  -.0290296    .016749    -1.73   0.084    -.0619403    .0038811
      month7 |  -.0343484   .0174474    -1.97   0.050    -.0686315   -.0000654
      month8 |  -.0384584   .0173885    -2.21   0.027    -.0726258    -.004291
      month9 |  -.0128549   .0180179    -0.71   0.476    -.0482589    .0225491
     month10 |  -.0024732   .0166148    -0.15   0.882    -.0351204    .0301739
     month11 |  -.0431935   .0134709    -3.21   0.001     -.069663   -.0167239
     month12 |   -.030492   .0172486    -1.77   0.078    -.0643844    .0034003
     h_chris |  -.0879397   .0343803    -2.56   0.011    -.1554948   -.0203845
     h_newyr |    .245256   .1112936     2.20   0.028     .0265707    .4639412
    h_easter |  -.0369402   .0138321    -2.67   0.008    -.0641194    -.009761
     h_july4 |    .035178   .0148879     2.36   0.019     .0059243    .0644317
       h_mem |   .0059252   .0117228     0.51   0.613    -.0171094    .0289597
     h_labor |   .0241491   .0108193     2.23   0.026     .0028898    .0454084
      w_rain |   -.032289   .0120337    -2.68   0.008    -.0559345   -.0086436
      w_snow |  -.0611942   .0422129    -1.45   0.148    -.1441401    .0217517
      w_maxa |   .1099056   .0111757     9.83   0.000      .087946    .1318652
      w_maxb |   .1107481   .0138328     8.01   0.000     .0835674    .1379287
      w_maxc |   .0423239   .0440855     0.96   0.338    -.0443014    .1289492
      w_mina |  -.3405203   .0576229    -5.91   0.000    -.4537459   -.2272948
      w_minb |  -.1725487   .0375872    -4.59   0.000    -.2464053   -.0986922
      w_minc |  -.1196086    .018433    -6.49   0.000    -.1558284   -.0833888
       _cons |   6.914316   .0199267   346.99   0.000     6.875161    6.953471
------------------------------------------------------------------------------

. dis 6*(-.0031689)+(-2)*(-.0031382)+(-1)*(-.0021052)
-.0106318

. /*(i
>  viewing a strongly violent movie decrease assaults, by 0.0031689*100%=0.32%. P(t) 
> =0.002<5%, significant at 5% level.
>   (ii
>  attend at strongly violent movies affect assaults differently than attendance at m
> oderate violent movies
>  also different from nonviolent movies.
>   (iii
>   6*(-.0031689)+(-2)*(-.0031382)+(-1)*(-.0021052)= -.0106318
>   predicted effect on assaults is decreasing assaults by 1.06%
> */
. *c
. ivreg ln_assaults (attend_v attend_m attend_n =  pr_attend_v pr_attend_m pr_attend_
> n) $yeardum $monthdum $holidum $weatherdum, r

Instrumental variables (2SLS) regression        Number of obs     =        516
                                                F(37, 478)        =    3121.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9959
                                                Root MSE          =     .04196

------------------------------------------------------------------------------
             |               Robust
 ln_assaults |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    attend_v |  -.0038738   .0009844    -3.94   0.000     -.005808   -.0019395
    attend_m |   -.003893   .0007632    -5.10   0.000    -.0053927   -.0023933
    attend_n |  -.0027221   .0007662    -3.55   0.000    -.0042277   -.0012165
       year2 |   .7019494   .0097997    71.63   0.000     .6826936    .7212052
       year3 |   1.019174   .0099945   101.97   0.000     .9995351    1.038812
       year4 |   1.229336   .0098594   124.69   0.000     1.209963    1.248709
       year5 |   1.391017   .0110527   125.85   0.000     1.369299    1.412735
       year6 |   1.690185   .0092153   183.41   0.000     1.672078    1.708293
       year7 |   1.842249   .0097237   189.46   0.000     1.823142    1.861355
       year8 |   1.902298   .0103664   183.51   0.000     1.881929    1.922668
       year9 |     1.9535   .0102022   191.48   0.000     1.933453    1.973546
      year10 |   2.075025   .0103457   200.57   0.000     2.054696    2.095354
      month2 |  -.0077646   .0124704    -0.62   0.534    -.0322682     .016739
      month3 |   .0110924   .0122002     0.91   0.364    -.0128803     .035065
      month4 |  -.0005342   .0148693    -0.04   0.971    -.0297513     .028683
      month5 |   .0076987   .0156259     0.49   0.622    -.0230052    .0384026
      month6 |  -.0269358   .0170656    -1.58   0.115    -.0604686     .006597
      month7 |  -.0307414   .0179425    -1.71   0.087    -.0659975    .0045146
      month8 |  -.0378367   .0174116    -2.17   0.030    -.0720494   -.0036241
      month9 |   -.016287   .0174138    -0.94   0.350     -.050504    .0179301
     month10 |  -.0044821    .016299    -0.27   0.783    -.0365088    .0275445
     month11 |  -.0408121   .0142156    -2.87   0.004    -.0687448   -.0128793
     month12 |  -.0309746   .0173603    -1.78   0.075    -.0650866    .0031374
     h_chris |   -.083975    .034649    -2.42   0.016    -.1520581   -.0158919
     h_newyr |   .2510778   .1104574     2.27   0.023     .0340358    .4681198
    h_easter |  -.0357588   .0137768    -2.60   0.010    -.0628294   -.0086883
     h_july4 |   .0348679   .0151747     2.30   0.022     .0050505    .0646853
       h_mem |   .0112309   .0118058     0.95   0.342    -.0119668    .0344287
     h_labor |   .0235949   .0107938     2.19   0.029     .0023857    .0448041
      w_rain |  -.0316783   .0120368    -2.63   0.009    -.0553299   -.0080267
      w_snow |  -.0599755   .0425581    -1.41   0.159    -.1435997    .0236487
      w_maxa |   .1101143   .0112436     9.79   0.000     .0880213    .1322073
      w_maxb |   .1123801   .0139727     8.04   0.000     .0849247    .1398355
      w_maxc |   .0469043   .0441377     1.06   0.288    -.0398237    .1336322
      w_mina |  -.3440014   .0582707    -5.90   0.000    -.4584999    -.229503
      w_minb |  -.1735184   .0375329    -4.62   0.000    -.2472683   -.0997686
      w_minc |   -.117815   .0185142    -6.36   0.000    -.1541942   -.0814359
       _cons |   6.924178   .0187017   370.24   0.000      6.88743    6.960926
------------------------------------------------------------------------------
Instrumented:  attend_v attend_m attend_n
Instruments:   year2 year3 year4 year5 year6 year7 year8 year9 year10 month2
               month3 month4 month5 month6 month7 month8 month9 month10
               month11 month12 h_chris h_newyr h_easter h_july4 h_mem
               h_labor w_rain w_snow w_maxa w_maxb w_maxc w_mina w_minb
               w_minc pr_attend_v pr_attend_m pr_attend_n
------------------------------------------------------------------------------

. /*
> viewing a strongly violent movie decrease assaults, by 0.0038738*100%=0.39%. P(t) =
> 0.000<1%, significant at 1% level.
> attend at strongly violent movies affect assaults differently than attendance at mo
> derate violent movies  
> also different from nonviolent movies. 
> 6*(-.0038738)+(-2)*(-.003893)+(-1)*(-.0027221)= -.0127347
> predicted effect on assaults is decreasing assaults by 1.27%
> */
. *d
. gen att_vs = attend_v_f+attend_v_b

. gen att_ms = attend_m_f+attend_m_b

. gen att_ns = attend_n_f+attend_n_b

. ivreg ln_assaults (attend_v attend_m attend_n = att_vs att_ms att_ns) $yeardum $mon
> thdum $holidum $weatherdum, r

Instrumental variables (2SLS) regression        Number of obs     =        516
                                                F(37, 478)        =    3089.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9959
                                                Root MSE          =     .04206

------------------------------------------------------------------------------
             |               Robust
 ln_assaults |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    attend_v |  -.0039783   .0019748    -2.01   0.045    -.0078587   -.0000978
    attend_m |  -.0043411   .0012949    -3.35   0.001    -.0068856   -.0017967
    attend_n |  -.0031528   .0017979    -1.75   0.080    -.0066855    .0003799
       year2 |   .7026242   .0097944    71.74   0.000     .6833787    .7218696
       year3 |   1.020178   .0100081   101.93   0.000     1.000513    1.039843
       year4 |    1.23104   .0097355   126.45   0.000      1.21191     1.25017
       year5 |   1.392094    .010626   131.01   0.000     1.371215    1.412974
       year6 |   1.691202   .0093011   181.83   0.000     1.672926    1.709478
       year7 |   1.843921   .0097401   189.31   0.000     1.824782    1.863059
       year8 |   1.905032   .0107264   177.60   0.000     1.883955    1.926108
       year9 |   1.955517   .0108886   179.59   0.000     1.934121    1.976912
      year10 |   2.076726   .0107057   193.98   0.000      2.05569    2.097762
      month2 |  -.0083606   .0123667    -0.68   0.499    -.0326603    .0159392
      month3 |   .0098868   .0119919     0.82   0.410    -.0136766    .0334501
      month4 |  -.0021555   .0151675    -0.14   0.887    -.0319588    .0276478
      month5 |   .0073981   .0158445     0.47   0.641    -.0237353    .0385316
      month6 |  -.0258975   .0171405    -1.51   0.131    -.0595776    .0077826
      month7 |  -.0294806   .0183188    -1.61   0.108    -.0654759    .0065147
      month8 |  -.0380687    .017093    -2.23   0.026    -.0716555   -.0044819
      month9 |  -.0187702   .0186024    -1.01   0.313    -.0553228    .0177824
     month10 |  -.0061861   .0165127    -0.37   0.708    -.0386325    .0262604
     month11 |  -.0395302   .0164169    -2.41   0.016    -.0717884    -.007272
     month12 |  -.0311847   .0171413    -1.82   0.069    -.0648662    .0024968
     h_chris |  -.0814318   .0345872    -2.35   0.019    -.1493936     -.01347
     h_newyr |   .2549341   .1066754     2.39   0.017     .0453234    .4645447
    h_easter |  -.0346807   .0141301    -2.45   0.014    -.0624455   -.0069159
     h_july4 |   .0348449   .0155059     2.25   0.025     .0043767    .0653131
       h_mem |   .0145208   .0157736     0.92   0.358    -.0164735     .045515
     h_labor |   .0232725   .0108452     2.15   0.032     .0019624    .0445826
      w_rain |  -.0314016   .0118073    -2.66   0.008    -.0546024   -.0082009
      w_snow |  -.0599618   .0433411    -1.38   0.167    -.1451245    .0252008
      w_maxa |   .1101555   .0113222     9.73   0.000      .087908     .132403
      w_maxb |     .11361   .0152938     7.43   0.000     .0835586    .1436614
      w_maxc |   .0513006   .0465111     1.10   0.271    -.0400908     .142692
      w_mina |  -.3454003   .0600876    -5.75   0.000    -.4634687   -.2273318
      w_minb |  -.1738733   .0374227    -4.65   0.000    -.2474066   -.1003399
      w_minc |  -.1170252    .018085    -6.47   0.000    -.1525611   -.0814894
       _cons |   6.930127   .0292357   237.04   0.000      6.87268    6.987573
------------------------------------------------------------------------------
Instrumented:  attend_v attend_m attend_n
Instruments:   year2 year3 year4 year5 year6 year7 year8 year9 year10 month2
               month3 month4 month5 month6 month7 month8 month9 month10
               month11 month12 h_chris h_newyr h_easter h_july4 h_mem
               h_labor w_rain w_snow w_maxa w_maxb w_maxc w_mina w_minb
               w_minc att_vs att_ms att_ns
------------------------------------------------------------------------------

. /*
> viewing a strongly violent movie decrease assaults, by 0.0031738*100%=0.32%. P(t) =
> 0.104, not significant
> attend at strongly violent movies affect assaults differently than attendance at mo
> derate violent movies  
> also different from nonviolent movies. 
> 6*(-.0031738)+(-2)*(-.0041215)+(-1)*(-.0025823)= -.0082175 
> predicted effect on assaults is decreasing assaults by 0.82%
> */
. *e
. ivregress 2sls ln_assaults (attend_v attend_m attend_n =  pr_attend_v attend_v_f at
> tend_v_b pr_attend_m attend_m_f attend_m_b pr_attend_n attend_n_f attend_n_b) $year
> dum $monthdum $holidum $weatherdum, r

Instrumental variables (2SLS) regression          Number of obs   =        516
                                                  Wald chi2(37)   =  124617.59
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.9959
                                                  Root MSE        =     .04041

------------------------------------------------------------------------------
             |               Robust
 ln_assaults |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    attend_v |  -.0039808   .0009226    -4.31   0.000    -.0057891   -.0021724
    attend_m |  -.0040052   .0006989    -5.73   0.000     -.005375   -.0026353
    attend_n |    -.00289    .000739    -3.91   0.000    -.0043384   -.0014416
       year2 |   .7020895   .0094293    74.46   0.000     .6836085    .7205705
       year3 |   1.019432   .0095735   106.48   0.000     1.000668    1.038196
       year4 |   1.229809   .0094083   130.72   0.000     1.211369    1.248249
       year5 |   1.391333   .0105729   131.59   0.000      1.37061    1.412055
       year6 |    1.69045   .0088546   190.91   0.000     1.673095    1.707804
       year7 |     1.8426   .0092796   198.57   0.000     1.824412    1.860787
       year8 |   1.902912   .0098543   193.11   0.000     1.883598    1.922226
       year9 |   1.954134    .009734   200.75   0.000     1.935056    1.973212
      year10 |   2.075582   .0098766   210.15   0.000     2.056224     2.09494
      month2 |  -.0078967   .0119857    -0.66   0.510    -.0313883    .0155948
      month3 |   .0107183   .0116761     0.92   0.359    -.0121664    .0336031
      month4 |  -.0010739   .0142329    -0.08   0.940    -.0289699    .0268221
      month5 |   .0073361   .0150339     0.49   0.626    -.0221298     .036802
      month6 |  -.0267382   .0164491    -1.63   0.104    -.0589779    .0055014
      month7 |  -.0303921   .0172653    -1.76   0.078    -.0642315    .0034474
      month8 |  -.0379641   .0167557    -2.27   0.023    -.0708046   -.0051236
      month9 |  -.0171513   .0166961    -1.03   0.304     -.049875    .0155724
     month10 |  -.0049876   .0156196    -0.32   0.749    -.0356014    .0256262
     month11 |  -.0402322   .0137827    -2.92   0.004    -.0672457   -.0132187
     month12 |  -.0310432   .0167078    -1.86   0.063    -.0637899    .0017035
     h_chris |  -.0830251   .0334196    -2.48   0.013    -.1485264   -.0175238
     h_newyr |   .2524374   .1059679     2.38   0.017     .0447442    .4601306
    h_easter |  -.0354393   .0132784    -2.67   0.008    -.0614644   -.0094142
     h_july4 |   .0347195   .0146193     2.37   0.018     .0060662    .0633728
       h_mem |   .0122783   .0113177     1.08   0.278    -.0099039    .0344605
     h_labor |   .0234736   .0103893     2.26   0.024     .0031109    .0438362
      w_rain |  -.0314975   .0115631    -2.72   0.006    -.0541607   -.0088344
      w_snow |  -.0601315   .0409998    -1.47   0.142    -.1404897    .0202267
      w_maxa |    .110133   .0108413    10.16   0.000     .0888844    .1313816
      w_maxb |   .1129293   .0135008     8.36   0.000     .0864682    .1393903
      w_maxc |   .0485352   .0424856     1.14   0.253    -.0347349    .1318054
      w_mina |  -.3440792   .0563138    -6.11   0.000    -.4544523   -.2337062
      w_minb |  -.1736866   .0361305    -4.81   0.000    -.2445011   -.1028721
      w_minc |  -.1175959   .0177821    -6.61   0.000    -.1524482   -.0827436
       _cons |   6.926377   .0178428   388.19   0.000     6.891406    6.961349
------------------------------------------------------------------------------
Instrumented:  attend_v attend_m attend_n
Instruments:   year2 year3 year4 year5 year6 year7 year8 year9 year10 month2
               month3 month4 month5 month6 month7 month8 month9 month10
               month11 month12 h_chris h_newyr h_easter h_july4 h_mem
               h_labor w_rain w_snow w_maxa w_maxb w_maxc w_mina w_minb
               w_minc pr_attend_v attend_v_f attend_v_b pr_attend_m
               attend_m_f attend_m_b pr_attend_n attend_n_f attend_n_b

. estat overid

  Test of overidentifying restrictions:

  Score chi2(6)          =  11.6791  (p = 0.0695)

. *f
. /* viewing violent movies can decrease the violent behavior, compared to viewing no
> n-violent movies
> or not vewing movies.
> 
> */
. 
. log close
      name:  <unnamed>
       log:  D:\大三上\中级计量经济学\老师发的\Lab\上机3&4\4.log
  log type:  text
 closed on:  13 Nov 2018, 20:48:32
-------------------------------------------------------------------------------------
