-------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\大三上\中级计量经济学\老师发的\Lab\上机3&4\5.log
  log type:  text
 opened on:  13 Nov 2018, 20:48:37

. clear all

. cd "D:\大三上\中级计量经济学\老师发的\Lab\上机3&4"
D:\大三上\中级计量经济学\老师发的\Lab\上机3&4

. import excel WeakInstrument, sheet(Sheet1) cellrange(A1:C201) firstrow

. *a
. ivregress 2sls y (x = z), r first

First-stage regressions
-----------------------

                                                Number of obs     =        200
                                                F(   1,    198)   =       4.27
                                                Prob > F          =     0.0400
                                                R-squared         =     0.0225
                                                Adj R-squared     =     0.0176
                                                Root MSE          =     0.9523

------------------------------------------------------------------------------
             |               Robust
           x |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           z |   .1346526   .0651282     2.07   0.040     .0062186    .2630866
       _cons |    .082566   .0687475     1.20   0.231    -.0530054    .2181374
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =        200
                                                  Wald chi2(1)    =       7.05
                                                  Prob > chi2     =     0.0079
                                                  R-squared       =     0.7795
                                                  Root MSE        =     .86436

------------------------------------------------------------------------------
             |               Robust
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   1.157732   .4360587     2.65   0.008     .3030724    2.012391
       _cons |  -.0142162   .0603029    -0.24   0.814    -.1324077    .1039752
------------------------------------------------------------------------------
Instrumented:  x
Instruments:   z

. /* the coefficient is 1.157732, the s.e is  0.4360587, 
> 95% Conf. Interval: [0.3030724, 2.012391]
> */
. *b
. reg x z, r

Linear regression                               Number of obs     =        200
                                                F(1, 198)         =       4.27
                                                Prob > F          =     0.0400
                                                R-squared         =     0.0225
                                                Root MSE          =     .95227

------------------------------------------------------------------------------
             |               Robust
           x |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           z |   .1346526   .0651282     2.07   0.040     .0062186    .2630866
       _cons |    .082566   .0687475     1.20   0.231    -.0530054    .2181374
------------------------------------------------------------------------------

. *F(1, 198) = 4.27 < 10, weak instrument
. *c
. ivregress 2sls y (x = z), r

Instrumental variables (2SLS) regression          Number of obs   =        200
                                                  Wald chi2(1)    =       7.05
                                                  Prob > chi2     =     0.0079
                                                  R-squared       =     0.7795
                                                  Root MSE        =     .86436

------------------------------------------------------------------------------
             |               Robust
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   1.157732   .4360587     2.65   0.008     .3030724    2.012391
       _cons |  -.0142162   .0603029    -0.24   0.814    -.1324077    .1039752
------------------------------------------------------------------------------
Instrumented:  x
Instruments:   z

. 
. /*
> foreach package in ivreg2 ranktest {
> capture which `package'
> if _rc==111 ssc install `package'
> }
> ivreg2 y (x = z), r first
> Anderson-Rubin Wald test           F(1,198)=       1.54     P-val=0.2154
> Anderson-Rubin Wald test           Chi-sq(1)=      1.56     P-val=0.2116
> F < Chi-sq(1), fail to reject the null assumption, 
> */
. 
. log close
      name:  <unnamed>
       log:  D:\大三上\中级计量经济学\老师发的\Lab\上机3&4\5.log
  log type:  text
 closed on:  13 Nov 2018, 20:48:38
-------------------------------------------------------------------------------------
