----------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\大三上\中级计量经济学\老师发的\Lab\上机5&6\HW3_2.log
  log type:  text
 opened on:  20 Dec 2018, 22:04:40

. *HW3_2
. clear all

. cd "D:\大三上\中级计量经济学\老师发的\Lab\上机5&6"
D:\大三上\中级计量经济学\老师发的\Lab\上机5&6

. import excel Stock_Returns_1931_2002, sheet(Sheet1) cellrange(A1:D865) firstrow

. des

Contains data
  obs:           864                          
 vars:             4                          
 size:        16,416                          
----------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------
time            int     %10.0g                time
Month           byte    %10.0g                Month
ExReturn        double  %10.0g                ExReturn
ln_DivYield     double  %10.0g                ln_DivYield
----------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. replace time=m(1931m1)+_n-1
(864 real changes made)

. format time %tm

. sort time

. tsset time
        time variable:  time, 1931m1 to 2002m12
                delta:  1 month

. 
. *a
. reg ExReturn L.ExReturn if tin(1932m1,2002m12), r

Linear regression                               Number of obs     =        852
                                                F(1, 850)         =       2.61
                                                Prob > F          =     0.1067
                                                R-squared         =     0.0097
                                                Root MSE          =     5.1352

------------------------------------------------------------------------------
             |               Robust
    ExReturn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    ExReturn |
         L1. |   .0982379   .0608249     1.62   0.107    -.0211468    .2176226
             |
       _cons |   .5237007   .1812761     2.89   0.004     .1678994    .8795021
------------------------------------------------------------------------------

. reg ExReturn L(1/2).ExReturn if tin(1932m1,2002m12), r

Linear regression                               Number of obs     =        852
                                                F(2, 849)         =       1.51
                                                Prob > F          =     0.2225
                                                R-squared         =     0.0113
                                                Root MSE          =     5.1341

------------------------------------------------------------------------------
             |               Robust
    ExReturn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    ExReturn |
         L1. |   .1024591   .0614689     1.67   0.096    -.0181896    .2231079
         L2. |  -.0398657   .0566186    -0.70   0.482    -.1509946    .0712631
             |
       _cons |   .5432659   .1862479     2.92   0.004     .1777057    .9088262
------------------------------------------------------------------------------

. reg ExReturn L(1/4).ExReturn if tin(1932m1,2002m12), r

Linear regression                               Number of obs     =        852
                                                F(4, 847)         =       1.40
                                                Prob > F          =     0.2318
                                                R-squared         =     0.0208
                                                Root MSE          =     5.1155

------------------------------------------------------------------------------
             |               Robust
    ExReturn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    ExReturn |
         L1. |    .098703   .0581441     1.70   0.090    -.0154204    .2128264
         L2. |  -.0294767    .053785    -0.55   0.584    -.1350443    .0760909
         L3. |  -.0975961   .0546594    -1.79   0.075    -.2048799    .0096877
         L4. |   .0064552   .0465497     0.14   0.890    -.0849112    .0978216
             |
       _cons |   .5902526   .1999956     2.95   0.003     .1977075    .9827977
------------------------------------------------------------------------------

. 
. 
. *b
. gen dln_DivYield=ln_DivYield[_n]-ln_DivYield[_n-1]
(1 missing value generated)

. reg ExReturn L.ExReturn L.dln_DivYield if tin(1932m1,2002m12), r

Linear regression                               Number of obs     =        852
                                                F(2, 849)         =       1.34
                                                Prob > F          =     0.2631
                                                R-squared         =     0.0097
                                                Root MSE          =     5.1382

------------------------------------------------------------------------------
             |               Robust
    ExReturn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    ExReturn |
         L1. |   .0927515   .1348284     0.69   0.492    -.1718846    .3573876
             |
dln_DivYield |
         L1. |  -.0054938   .1322777    -0.04   0.967    -.2651234    .2541357
             |
       _cons |   .5258722    .203791     2.58   0.010      .125879    .9258655
------------------------------------------------------------------------------

. reg ExReturn L(1/2).ExReturn L(1/2).dln_DivYield if tin(1932m1,2002m12), r

Linear regression                               Number of obs     =        852
                                                F(4, 847)         =       0.80
                                                Prob > F          =     0.5226
                                                R-squared         =     0.0116
                                                Root MSE          =     5.1395

------------------------------------------------------------------------------
             |               Robust
    ExReturn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    ExReturn |
         L1. |    .109467   .1238789     0.88   0.377    -.1336786    .3526127
         L2. |  -.0877985   .1536146    -0.57   0.568    -.3893084    .2137113
             |
dln_DivYield |
         L1. |   .0069862   .1193423     0.06   0.953    -.2272551    .2412276
         L2. |  -.0480258   .1292498    -0.37   0.710    -.3017133    .2056618
             |
       _cons |   .5593629   .2282535     2.45   0.014      .111354    1.007372
------------------------------------------------------------------------------

. reg ExReturn L.ExReturn L.ln_DivYield if tin(1932m1,2002m12), r

Linear regression                               Number of obs     =        852
                                                F(2, 849)         =       3.09
                                                Prob > F          =     0.0462
                                                R-squared         =     0.0182
                                                Root MSE          =     5.1162

------------------------------------------------------------------------------
             |               Robust
    ExReturn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    ExReturn |
         L1. |    .103968   .0602619     1.73   0.085    -.0143119    .2222479
             |
 ln_DivYield |
         L1. |   .0126844   .0064846     1.96   0.051    -.0000433     .025412
             |
       _cons |   4.685037   2.200638     2.13   0.034     .3657076    9.004366
------------------------------------------------------------------------------

. 
. *c
. dfuller ln_DivYield, lags(2) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       861

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.232            -3.430            -2.860            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.1947

------------------------------------------------------------------------------
D.           |
 ln_DivYield |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 ln_DivYield |
         L1. |  -.0112962   .0050604    -2.23   0.026    -.0212285   -.0013639
         LD. |   .0961067   .0341523     2.81   0.005     .0290747    .1631387
        L2D. |  -.0012908   .0341195    -0.04   0.970    -.0682583    .0656767
             |
       _cons |  -3.807104   1.668453    -2.28   0.023    -7.081836   -.5323721
------------------------------------------------------------------------------

. *t=-2.232, does not reject a unit root at 10%, some evidence of unit root, we find ln_DivYield is highly persistent.
. 
. *d
. reg ExReturn L.ExReturn L.dln_DivYield if tin(1932m1,2002m12), r

Linear regression                               Number of obs     =        852
                                                F(2, 849)         =       1.34
                                                Prob > F          =     0.2631
                                                R-squared         =     0.0097
                                                Root MSE          =     5.1382

------------------------------------------------------------------------------
             |               Robust
    ExReturn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    ExReturn |
         L1. |   .0927515   .1348284     0.69   0.492    -.1718846    .3573876
             |
dln_DivYield |
         L1. |  -.0054938   .1322777    -0.04   0.967    -.2651234    .2541357
             |
       _cons |   .5258722    .203791     2.58   0.010      .125879    .9258655
------------------------------------------------------------------------------

. predict ExReturn_hat
(option xb assumed; fitted values)
(2 missing values generated)

. 
. *e
. gen fe=ExReturn-ExReturn_hat
(2 missing values generated)

. sum fe

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          fe |        862   -.0886874    5.353569  -34.80418   31.61712

. gen sfe=(fe)^2
(2 missing values generated)

. sum sfe

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         sfe |        862    28.63532    86.72784   4.53e-06   1211.331

. gen msfe=_result(3)

. dis msfe
28.635319

. gen rmsfe=(msfe)^(1/2)

. dis "rmsfe=" rmsfe
rmsfe=5.3511977

. 
. /* in the a, Root MSE=5.1352 < rmsfe The pseudo out-of-sample forecast based on the ADL(1,1)
> model with the log dividend yield does worse than forecasts in which there are no predictors.
> the results in (a) through (d) suggest important changes to the conclusions reached in the boxes.
> We can conclude that this lack of predictability is consistent with the strong form of the efficient markets hypothe
> sis,
> which holds that all publicly available information is incorporated into stock prices so that returns should not be 
> predictable 
> using publicly available information.
> */
. 
. 
. log close
      name:  <unnamed>
       log:  D:\大三上\中级计量经济学\老师发的\Lab\上机5&6\HW3_2.log
  log type:  text
 closed on:  20 Dec 2018, 22:04:42
----------------------------------------------------------------------------------------------------------------------
