----------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\大三上\中级计量经济学\老师发的\Lab\上机5&6\HW3_1.log
  log type:  text
 opened on:  20 Dec 2018, 21:50:32

. *HW3_1
. clear all

. cd "D:\大三上\中级计量经济学\老师发的\Lab\上机5&6"
D:\大三上\中级计量经济学\老师发的\Lab\上机5&6

. import excel us_macro_quarterly, sheet(us_macro_quarterly.xls) cellrange(A1:J229) firstrow

. des

Contains data
  obs:           228                          
 vars:            10                          
 size:        18,012                          
----------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------
TIME            str7    %9s                   TIME
GDPC96          double  %10.0g                GDPC96
JAPAN_IP        double  %10.0g                JAPAN_IP
PCECTPI         double  %10.0g                PCECTPI
GS10            double  %10.0g                GS10
GS1             double  %10.0g                GS1
TB3MS           double  %10.0g                TB3MS
UNRATE          double  %10.0g                UNRATE
EXUSUK          double  %10.0g                EXUSUK
CPIAUCSL        double  %10.0g                CPIAUCSL
----------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. destring TIME, replace ignore (":")
TIME: character : removed; replaced as long

. generate time=q(1957q1)+_n-1

. format time %tq

. sort time

. tsset time
        time variable:  time, 1957q1 to 2013q4
                delta:  1 quarter

. 
. 
. *a
. gen LPCECTPI = log(PCECTPI)

. gen infl = 400*(LPCECTPI[_n]-LPCECTPI[_n-1])
(1 missing value generated)

. des infl

              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------------------------------
infl            float   %9.0g                 

. *the unit of infl is percentage points per year.
. line infl time if tin(1963q1,2012q4), title(inflation over time) saving(inflation, replace)
(file inflation.gph saved)

. *I think Infl has a stochastic trend. It looks like random walk.
. 
. 
. *b
. corrgram inf if tin(1963q1,2012q4), noplot lags(4)

 LAG       AC       PAC      Q     Prob>Q
-----------------------------------------
1        0.8260   0.8284   138.51  0.0000                     
2        0.7373   0.1824   249.43  0.0000                     
3        0.7124   0.2199    353.5  0.0000                     
4        0.6432  -0.0451   438.79  0.0000                     

. gen dinfl = infl[_n]-infl[_n-1]
(2 missing values generated)

. line dinfl time if tin(1963q1,2012q4), title(difference of inflation over time) saving(difference_of_inflation, repl
> ace)
(file difference_of_inflation.gph saved)

. *dinfl changes a lot, so the graph is choppy.
. 
. 
. *c
. reg dinfl L.dinfl if tin(1963q1,2012q4), r

Linear regression                               Number of obs     =        200
                                                F(1, 198)         =      12.67
                                                Prob > F          =     0.0005
                                                R-squared         =     0.0641
                                                Root MSE          =     1.4549

------------------------------------------------------------------------------
             |               Robust
       dinfl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       dinfl |
         L1. |  -.2531032   .0710996    -3.56   0.000    -.3933129   -.1128934
             |
       _cons |   .0028787   .1028671     0.03   0.978    -.1999771    .2057344
------------------------------------------------------------------------------

. dis "Adjusted Rsquared = " _result(8)
Adjusted Rsquared = .05933796

. *Rsquared is very small, this means knowing the change in
. *inflation this quarter  can't help predict the change in inflation next quarter much.
. reg dinfl L(1/2).dinfl if tin(1963q1,2012q4), r

Linear regression                               Number of obs     =        200
                                                F(2, 197)         =      12.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1293
                                                Root MSE          =     1.4068

------------------------------------------------------------------------------
             |               Robust
       dinfl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       dinfl |
         L1. |  -.3199765   .0668392    -4.79   0.000    -.4517887   -.1881643
         L2. |  -.2641485   .0825584    -3.20   0.002    -.4269601   -.1013369
             |
       _cons |     .00263    .099481     0.03   0.979    -.1935543    .1988143
------------------------------------------------------------------------------

. dis "Adjusted Rsquared = " _result(8)
Adjusted Rsquared = .12049595

. *Rsquared is bigger, so the AR(2) model is better than an AR(1) model
. reg dinfl L.dinfl if tin(1963q1,2012q4), r

Linear regression                               Number of obs     =        200
                                                F(1, 198)         =      12.67
                                                Prob > F          =     0.0005
                                                R-squared         =     0.0641
                                                Root MSE          =     1.4549

------------------------------------------------------------------------------
             |               Robust
       dinfl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       dinfl |
         L1. |  -.2531032   .0710996    -3.56   0.000    -.3933129   -.1128934
             |
       _cons |   .0028787   .1028671     0.03   0.978    -.1999771    .2057344
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |        200 -364.3856  -357.7647       2    719.5294   726.1261
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. reg dinfl L(1/2).dinfl if tin(1963q1,2012q4), r

Linear regression                               Number of obs     =        200
                                                F(2, 197)         =      12.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1293
                                                Root MSE          =     1.4068

------------------------------------------------------------------------------
             |               Robust
       dinfl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       dinfl |
         L1. |  -.3199765   .0668392    -4.79   0.000    -.4517887   -.1881643
         L2. |  -.2641485   .0825584    -3.20   0.002    -.4269601   -.1013369
             |
       _cons |     .00263    .099481     0.03   0.979    -.1935543    .1988143
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |        200 -364.3856  -350.5358       3    707.0716   716.9666
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. reg dinfl L(1/3).dinfl if tin(1963q1,2012q4), r

Linear regression                               Number of obs     =        200
                                                F(3, 196)         =       8.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1294
                                                Root MSE          =     1.4103

------------------------------------------------------------------------------
             |               Robust
       dinfl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       dinfl |
         L1. |   -.317344   .0648189    -4.90   0.000     -.445176   -.1895119
         L2. |  -.2609738   .0832738    -3.13   0.002    -.4252016   -.0967461
         L3. |   .0099769   .0887084     0.11   0.911    -.1649685    .1849224
             |
       _cons |   .0026023    .099786     0.03   0.979    -.1941897    .1993943
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |        200 -364.3856  -350.5259       4    709.0518    722.245
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. reg dinfl L(1/4).dinfl if tin(1963q1,2012q4), r

Linear regression                               Number of obs     =        200
                                                F(4, 195)         =       7.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1402
                                                Root MSE          =     1.4051

------------------------------------------------------------------------------
             |               Robust
       dinfl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       dinfl |
         L1. |  -.3162138   .0640662    -4.94   0.000    -.4425655   -.1898622
         L2. |  -.2901716    .084278    -3.44   0.001     -.456385   -.1239582
         L3. |  -.0250757   .0918139    -0.27   0.785    -.2061513        .156
         L4. |  -.1112941   .0845672    -1.32   0.190    -.2780779    .0554897
             |
       _cons |   .0031299   .0993698     0.03   0.975    -.1928476    .1991073
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |        200 -364.3856  -349.2806       5    708.5612   725.0528
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. reg dinfl L(1/5).dinfl if tin(1963q1,2012q4), r

Linear regression                               Number of obs     =        200
                                                F(5, 194)         =       6.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1516
                                                Root MSE          =     1.3994

------------------------------------------------------------------------------
             |               Robust
       dinfl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       dinfl |
         L1. |  -.3290624   .0645705    -5.10   0.000    -.4564128    -.201712
         L2. |  -.2929103    .084605    -3.46   0.001     -.459774   -.1260466
         L3. |  -.0588438   .0966534    -0.61   0.543    -.2494703    .1317826
         L4. |  -.1474597   .0866892    -1.70   0.091     -.318434    .0235145
         L5. |   -.115154   .0747806    -1.54   0.125    -.2626413    .0323333
             |
       _cons |   .0038727   .0989229     0.04   0.969    -.1912298    .1989752
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |        200 -364.3856  -347.9486       6    707.8971    727.687
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. reg dinfl L(1/6).dinfl if tin(1963q1,2012q4), r

Linear regression                               Number of obs     =        200
                                                F(6, 193)         =       5.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1588
                                                Root MSE          =      1.397

------------------------------------------------------------------------------
             |               Robust
       dinfl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       dinfl |
         L1. |  -.3182849   .0652385    -4.88   0.000    -.4469569    -.189613
         L2. |  -.2792925   .0828184    -3.37   0.001    -.4426379   -.1159471
         L3. |  -.0530927   .0966775    -0.55   0.584    -.2437727    .1375873
         L4. |  -.1204959   .0896436    -1.34   0.180    -.2973027     .056311
         L5. |  -.0843275   .0803662    -1.05   0.295    -.2428363    .0741812
         L6. |   .0925135   .0550963     1.68   0.095    -.0161547    .2011817
             |
       _cons |   .0018986   .0988301     0.02   0.985    -.1930271    .1968242
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |        200 -364.3856  -347.0904       7    708.1807   731.2689
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. reg dinfl L(1/7).dinfl if tin(1963q1,2012q4), r

Linear regression                               Number of obs     =        200
                                                F(7, 192)         =       5.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1597
                                                Root MSE          =     1.3999

------------------------------------------------------------------------------
             |               Robust
       dinfl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       dinfl |
         L1. |  -.3152405   .0677916    -4.65   0.000    -.4489525   -.1815285
         L2. |  -.2821362     .08552    -3.30   0.001    -.4508155   -.1134568
         L3. |   -.057055    .098401    -0.58   0.563    -.2511408    .1370308
         L4. |  -.1224379   .0927425    -1.32   0.188    -.3053628     .060487
         L5. |  -.0934965   .0842964    -1.11   0.269    -.2597624    .0727693
         L6. |   .0817766   .0650653     1.26   0.210    -.0465579    .2101111
         L7. |  -.0330122   .1176602    -0.28   0.779    -.2650848    .1990603
             |
       _cons |   .0025007   .0982147     0.03   0.980    -.1912177    .1962191
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |        200 -364.3856  -346.9814       8    709.9627   736.3493
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. reg dinfl L(1/8).dinfl if tin(1963q1,2012q4), r

Linear regression                               Number of obs     =        200
                                                F(8, 191)         =       4.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1601
                                                Root MSE          =     1.4032

------------------------------------------------------------------------------
             |               Robust
       dinfl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       dinfl |
         L1. |  -.3159587   .0686509    -4.60   0.000    -.4513699   -.1805474
         L2. |  -.2803388   .0878575    -3.19   0.002    -.4536344   -.1070432
         L3. |  -.0591094   .0991513    -0.60   0.552    -.2546815    .1364627
         L4. |  -.1251785   .0919102    -1.36   0.175    -.3064678    .0561108
         L5. |  -.0948183   .0849494    -1.12   0.266    -.2623777    .0727412
         L6. |   .0755768   .0680444     1.11   0.268    -.0586381    .2097917
         L7. |  -.0400861    .105993    -0.38   0.706    -.2491532    .1689809
         L8. |  -.0220509   .0900304    -0.24   0.807    -.1996324    .1555307
             |
       _cons |   .0027573   .0986589     0.03   0.978    -.1918436    .1973581
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |        200 -364.3856  -346.9327       9    711.8654   741.5503
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. * AIC:5   BIC:2
. reg dinfl L(1/2).dinfl if tin(1963q1,2012q4), r

Linear regression                               Number of obs     =        200
                                                F(2, 197)         =      12.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1293
                                                Root MSE          =     1.4068

------------------------------------------------------------------------------
             |               Robust
       dinfl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       dinfl |
         L1. |  -.3199765   .0668392    -4.79   0.000    -.4517887   -.1881643
         L2. |  -.2641485   .0825584    -3.20   0.002    -.4269601   -.1013369
             |
       _cons |     .00263    .099481     0.03   0.979    -.1935543    .1988143
------------------------------------------------------------------------------

. predict dinfl_hat
(option xb assumed; fitted values)
(4 missing values generated)

. * the predicted value of Infl2013:1Q is -.14086185
. * the predicted level of the inflation rate in 2013:Q1 is -.14086185+1.6126633=1.4718014
. dis -.14086185+1.6126633
1.4718014

. 
. 
. *d
. dfuller infl, lags(2) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       224

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.707            -3.469            -2.882            -2.572
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0728

------------------------------------------------------------------------------
      D.infl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        infl |
         L1. |  -.1063285   .0392764    -2.71   0.007    -.1837347   -.0289223
         LD. |  -.2883131   .0686882    -4.20   0.000    -.4236843    -.152942
        L2D. |  -.2011818   .0664314    -3.03   0.003    -.3321051   -.0702584
             |
       _cons |   .3433436   .1602571     2.14   0.033      .027508    .6591792
------------------------------------------------------------------------------

. * t=-2.707, rejects a unit root at 10% level but not at 5% level
. dfuller infl, lags(2) trend regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       224

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.900            -3.999            -3.433            -3.133
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.1621

------------------------------------------------------------------------------
D.infl       |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        infl |
         L1. |  -.1171888   .0404037    -2.90   0.004    -.1968186   -.0375589
         LD. |  -.2827362     .06882    -4.11   0.000    -.4183704    -.147102
        L2D. |   -.198724   .0664239    -2.99   0.003    -.3296358   -.0678122
      _trend |  -.0016673    .001471    -1.13   0.258    -.0045665    .0012319
       _cons |   .5704164   .2564903     2.22   0.027      .064911    1.075922
------------------------------------------------------------------------------

. * t=-2.900, does not reject a unit root at 10% level，better.
. * so the first is not preferred to the latter with trend.
. 
. dfuller infl, lags(5) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       221

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.165            -3.470            -2.882            -2.572
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.2192

------------------------------------------------------------------------------
      D.infl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        infl |
         L1. |  -.0880587    .040674    -2.16   0.031    -.1682317   -.0078857
         LD. |  -.2962155   .0731931    -4.05   0.000    -.4404872   -.1519438
        L2D. |  -.2318642   .0740263    -3.13   0.002    -.3777782   -.0859501
        L3D. |  -.0498159   .0749414    -0.66   0.507    -.1975338     .097902
        L4D. |  -.1047461   .0716942    -1.46   0.145    -.2460633    .0365712
        L5D. |  -.1014371   .0668182    -1.52   0.130    -.2331432    .0302691
             |
       _cons |   .2904171   .1641692     1.77   0.078    -.0331786    .6140127
------------------------------------------------------------------------------

. *t=-2.165, does not reject at 10%, this is lag the AIC prefer, and the Rsquared is bigger. maybe better than lag of 
> 2.
. *so more lags may be better, we can choose 5.
. 
. *the (i) rejects a unit root at 10% level but not at 5% level.
. *failing to reject(FTR) does not mean the null is true, but we can say there is Some evidence of a unit root – not c
> lear cut.
. 
. 
. *e
. estat sbsingle
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
........................................

Test for a structural break: Unknown break date

                             Number of obs =        200

Full sample:                 1963q1 - 2012q4
Trimmed sample:              1970q3 - 2005q3
Estimated break date:        1974q3
Ho: No structural break

     Test            Statistic          p-value
-----------------------------------------------
     swald            10.2046           0.1978
-----------------------------------------------
Exogenous variables:           L.dinfl L2.dinfl
Coefficients included in test: L.dinfl L2.dinfl _cons

. *p_value=0.1978>0.1, can not reject the null at 10%, we think the model is stable.
. 
. *f
. reg dinfl L(1/2).dinfl if tin(1963q1,2002q4), r

Linear regression                               Number of obs     =        160
                                                F(2, 157)         =       7.19
                                                Prob > F          =     0.0010
                                                R-squared         =     0.0990
                                                Root MSE          =     1.1991

------------------------------------------------------------------------------
             |               Robust
       dinfl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       dinfl |
         L1. |  -.3018189   .0825483    -3.66   0.000    -.4648674   -.1387705
         L2. |  -.1944979   .0770067    -2.53   0.013    -.3466008   -.0423951
             |
       _cons |   .0077783   .0948862     0.08   0.935    -.1796398    .1951965
------------------------------------------------------------------------------

. predict dinfl_hat1
(option xb assumed; fitted values)
(4 missing values generated)

. gen fe= dinfl-dinfl_hat1 if tin(2003q1,2012q4)
(188 missing values generated)

. sum fe

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          fe |         40   -.0254224    2.063884  -9.716151   3.274473

. gen sfe=(fe)^2
(188 missing values generated)

. sum sfe

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         sfe |         40    4.153771    14.92083   .0001473   94.40359

. gen msfe=_result(3)

. dis msfe
4.1537714

. gen rmsfe=(msfe)^(1/2)

. dis "rmsfe=" rmsfe
rmsfe=2.0380802

. /*the forecasts are dinfl_hat1
> .2737572
> -.2546307
> .5577055
> -.1414871
> -.148019
> -.264019
> -.1978824
> .1989463
> -.1473093
> .1716431
> .0443869
> -.6209659
> .0480272
> .6335815
> -.1123476
> -.1628754
> 1.114336
> -.6313962
> -.6797541
> .386235
> -.3378887
> -.1551652
> -.1063591
> -.1089831
> 2.991516
> .864515
> -1.894148
> -.9970336
> -.2003172
> .3763086
> .5461434
> -.0350702
> -.4168141
> -.4252429
> -.3619196
> .2880114
> .5547899
> -.0855659
> .1908099
> .0536658
> */
. * the mean is  -.0254224!=0, so the pseudo out-of-sample forecasts is biased
. *rmsfe=2.0380802
. * AR(2) Root MSE = 1.1991< rmsfe, NOT consistent
. * 2008's financial crisis make the inflation fall quickly in 2008q4.
.  
. 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  D:\大三上\中级计量经济学\老师发的\Lab\上机5&6\HW3_1.log
  log type:  text
 closed on:  20 Dec 2018, 21:50:36
----------------------------------------------------------------------------------------------------------------------
